app/views/orders/_form.html.slim

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
---
    tbody
      - @cart.cart_items.each do |cart_item|

SELECT "cart_items"."amount" FROM "cart_items" WHERE "cart_items"."item_id" = $1  [["item_id", 4]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---

          td.sum = cart_item.item.price * cart_item.amount