app/views/orders/_order_item.html.slim

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 6]]
---
tr.order_item *{'data-item-id' => order_item.id}