app/views/orders/_order_items.html.slim


table.order_items
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = $1  [["order_id", 6]]