app/views/orders/new.html.slim

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
---
= turbo_frame_tag "new_order"
  - if @cart.cart_items.present?