app/views/items/_item.html.slim

.item.box.column.is-one-quarter.m-5 data-category-id="#{item.category.id}" data-search-target="item" data-item-id="#{item.id}" id="#{dom_id(item)}"
  .row
---
SELECT "items".* FROM "items" WHERE "items"."category_id" = $1  [["category_id", 1]]