app/controllers/cart_items_controller.rb

  def create
    authorize CartItem

    respond_to do |format|
      format.html do
        amount  = params[:cart_item][:amount].to_i
        item_id = params[:cart_item][:item_id].to_i

        @cart_item = current_user.cart.cart_items.find_or_initialize_by(item_id: item_id)

        if @cart_item.persisted? ? @cart_item.change_amount_by!(amount) : @cart_item.update(amount: amount)
          redirect_to cart_path, notice: t(".message")
        else
          redirect_to item_path(@cart_item.item), notice: @cart_item.errors.full_messages.join("; ")
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cart_items" SET "amount" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["amount", 2], ["updated_at", "2022-01-24 14:55:02.504933"], ["id", 19]]
SELECT "cart_items"."amount" FROM "cart_items" WHERE "cart_items"."item_id" = $1  [["item_id", 5]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]