app/controllers/cart_items_controller.rb

  def create
    authorize CartItem

    @cart_item = current_user.cart.cart_items.new(cart_item_params)
    respond_to do |format|
      format.json do
        unless @cart_item.save
          render json: { message: @cart_item.errors.full_messages.join("; ") }, status: :unprocessable_entity
---
INSERT INTO "cart_items" ("cart_id", "item_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["cart_id", 1], ["item_id", 15], ["amount", 5], ["created_at", "2022-01-24 14:54:49.306205"], ["updated_at", "2022-01-24 14:54:49.306205"]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1 AND "cart_items"."item_id" = $2 LIMIT $3  [["cart_id", 2], ["item_id", 7], ["LIMIT", 1]]
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]

  def update
    respond_to do |format|
      format.json do
        unless @cart_item.update(amount: params[:cart_item][:amount].to_i)
          render json: { message: @cart_item.errors.full_messages.join("; ") }, status: :unprocessable_entity
---
UPDATE "cart_items" SET "amount" = $1, "updated_at" = $2 WHERE "cart_items"."id" = $3  [["amount", 4], ["updated_at", "2022-01-21 12:50:29.038072"], ["id", 1]]
SELECT "cart_items"."amount" FROM "cart_items" WHERE "cart_items"."item_id" = $1  [["item_id", 4]]

  def destroy
    respond_to do |format|
      format.json { @cart_item.destroy }
---
DELETE FROM "cart_items" WHERE "cart_items"."id" = $1  [["id", 13]]

  def load_cart_item
    @cart_item = authorize CartItem.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]