app/controllers/items_controller.rb

  def load_items
    @items = Item.all
    @items = @items.where(category: params[:category_id]) if params[:category_id]
---
SELECT "items".* FROM "items"
SELECT "items".* FROM "items" WHERE "items"."category_id" = $1  [["category_id", 1]]

  def load_item
    @item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]