app/controllers/orders_controller.rb

INSERT INTO "orders" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2022-01-21 12:30:51.033397"], ["updated_at", "2022-01-21 12:30:51.033397"]]
---
  def create
    @order = current_user.orders.new(order_params)

    respond_to do |format|
      format.json {
        if @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @order = authorize Order.find(params[:id])