app/models/cart.rb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = $1  [["cart_id", 1]]
SELECT "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def total_sum
    cart_items.map { |cart_item| cart_item.item.price * cart_item.amount }.sum