app/models/item.rb

  def available_amount
    reserved = CartItem.where(item: self).pluck(:amount).sum
---
SELECT "cart_items"."amount" FROM "cart_items" WHERE "cart_items"."item_id" = $1  [["item_id", 15]]