app/models/user.rb

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = $1 AND "subscriptions"."item_id" = $2  [["user_id", 1], ["item_id", 15]]
DELETE FROM "subscriptions" WHERE "subscriptions"."id" = $1  [["id", 1]]
---
  def subscribe!(item:)
    subscription = Subscription.find_or_initialize_by(user: self, item: item)
    if subscription.persisted?
      subscription.destroy

SELECT "subscriptions".* FROM "subscriptions" WHERE "subscriptions"."user_id" = $1 AND "subscriptions"."item_id" = $2  [["user_id", 2], ["item_id", 7]]
---
  def subscribed?(item:)
    Subscription.where(user: self, item: item).present?